{
  "bio":{
     "title":"Biography",
     "description":"Patrick O'Shea is an interdisciplinary artist who delves into the intersections of technology, culture, and ecology. His work, speculative in nature, scrutinizes the pervasive impacts of our technological inheritance. Utilizing diverse mediums from digital art and software to robotics, O'Shea's projects are a reflection on the dual-edged influence of technology on society and the environment. Internationally recognized, his contributions at events like COP26 and collaborations with institutions such as Texas Tech University highlight a commitment to probing the ethical dimensions of technological development. O'Shea's art has been featured in significant exhibitions, including Ars Electronica and the Wrong Biennale, posing critical questions on the narratives we construct about progress and the unseen costs of technological advancement.<br><br> <br>GitHub: <a href='https://github.com/posheadig' target='_blank'>github.com/posheadig</a>        |||||||||||||||        Instagram: <a href='https://www.instagram.com/patrick___oshea/' target='_blank'>instagram.com/patrick___oshea/</a>        |||||||||||||||        <a href='./assets/CV_simple.pdf' target='_blank'>View CV</a>",
     "images":[
        {
           "src":"./assets/bio/2.png",
           "width":"50%",
           "height":"auto",
           "footnote":""
        }
     ]
  },
  "contact":{
     "title":"Contact",
     "description":"<p id=\"email\">Email: cGNvc2hlYTJAZ21haWwuY29t <button onclick=\"revealEmail()\">Click to reveal</button></p><br>GitHub: <a href='https://github.com/posheadig' target='_blank'>github.com/posheadig</a> <br> Instagram: <a href='https://www.instagram.com/patrick___oshea/' target='_blank'>instagram.com/patrick___oshea/</a>",
     "images":[
     ]
  },
   "News Currencies =": {
     "title": "News Currencies =",
     "description": "This project delves into the critical analysis of media ecology, underscoring the complexities of mis/disinformation within the digital landscape, through functional data frameworks (github pages linked below to try on your own) and speculative demonstrations<br><br> <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/w1ACORJNVp4?si=_shp4fl7NRJGQwIB\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe><br> <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/65zHikzmyQs?si=_shp4fl7NRJGQwIB\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe><br> <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/v3d7eWChAQ8?si=_shp4fl7NRJGQwIB\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe><br><br><br> it reflects on the nuanced interplay between technology and societal discourse. A focal point of this investigation is the emerging productization of AI, particularly how AI-driven tools, built on platforms like Wikipedia, inherit and perpetuate existing biases. Wikipedia's 'no original research' policy, while intended to preserve neutrality, inadvertently shapes the foundation upon which AI's understanding of the world is constructed, embedding a skewed perspective at the core of these technologies. Critical scrutiny extends to the infrastructures underpinning AI, revealing a landscape rife with partiality and predispositions. By integrating critical cryptography analysis, the project examines the ambivalent role of encryption and blockchain in safeguarding against disinformation, juxtaposed against their capacity to obfuscate truth. <br><br>The exploration emphasizes the speculative nature of solutions in addressing the multifaceted phenomenon of misinformation. It posits that while technological advancements offer novel approaches to mitigating misinformation, they fall short in grappling with its root causes—stemming from the very fabric of digital media and its governance. The discourse suggests that a reimagined approach, transcending technological fixes, is imperative for fostering a well-informed society. This entails a distributed strategy encompassing digital literacy, ethical news consumption, and a critical reevaluation of the paradigms governing digital platforms.<br><br>Personal Project GitHub repositories: <ul><li><a href='https://github.com/posheadig/Critical-Data-Framework'>Critical Data Framework</a>: Provides the foundational codebase for integrating blockchain technology with AI, including the creation of novel ERC-20 contracts paired with native currencies and other digital assets.</li><li><a href='https://github.com/posheadig/dadasWebClient_Demo'>dadasWebClient_Demo</a>: A web3 codebase example for interacting with ERC20 contracts and liquidity provision protocols.</li><li><a href='https://github.com/posheadig/dadasSubGraph'>dadasSubGraph</a>: Custom subgraph for tracking blockchain data, facilitating enhanced analytics and insights.</li><li><a href='https://github.com/posheadig/ipfs-sqlite-blockchain'>ipfs-sqlite-blockchain</a>: Showcases the integration of IPFS with SQLite and blockchain, a novel approach to decentralized data management and storage.</li></ul>",
     "images": []
   }, 
"Bovine Weather Model":{
   "title":"Bovine Weather Model: Localized Weather Prediction",
   "description":"Is it true that cows lie down when it’s about to rain?<br><br> Leveraging the age-old observation that cows tend to lie down when rain is imminent and stand when it's likely to remain dry, this model inverts traditional logic by employing AI techniques.<br><br>This project and line of research is critical towards the usage of AI in capital markets, and inverts the logic from human based to nonhuman.<br><br> Through the real-time analysis of YouTube live cams, coupled with advanced object detection algorithms, it tracks these bovine behaviors to create a localized metric of rain probability. This method not only pays homage to the wisdom encapsulated within rural folklore but also embraces modern AI training practices. <br>The Bovine Weather Model represents a fusion of local knowledge with global technology, exploring the subtle cues from nature to predict future events.<br><br>",
   "images":[
      {
         "src":"./assets/bovine/1.gif",
         "width":"90%",
         "height":"auto",
         "footnote":"This animated visualization showcases the predictive behavior of cows in relation to weather changes, illustrating the core concept behind the Bovine Weather Model."
      }
   ]
},
  "Searching for Null":{
     "title":"Searching for Null",
     "description":"<p>This is a brute force attack program that touches on themes of personal security, computational energy usage, and lore of nefarious programs that are and have been constantly running and can emerge at any moment sending effects to everyday life.</p><p>\"Searching for Null\" plunges into the enigma of Ethereum's 0x0000000000000000000000000000000000000000 address, a digital void that harbors 'burned' funds, where transfers are sent to throw away a key. This address, often metaphorically likened to a black hole, receives assets when owners opt to discard their access keys, effectively sending value into a state of absence.</p><div class='figure'><img src='./assets/zero/1.gif' alt='synthetic-financialization' class='project-image'><p class='footnote'>Screenshot of 'Searching for Address Zero', a program I wrote that brute force attacks address 0 on the Ethereum network. Shown in the recent exhibition, <a href='https://thewrong.org/reversetarpit' target='_blank'>reverse tarpit</a></p></div><p>While brute forcing secret keys remains a double-edged sword—redeeming lost assets on one side and facilitating covert heists on the other—this project channels that intense computation to challenge a crypto myth. Could the so-called 'burned' assets ever be reclaimed? And if unearthed, where would they be best sent?</p><p>As the program relentlessly generates wallets and secret keys, striving for that elusive alignment with address(0), its journey is visualized through a maze's ever-evolving pathways, with shifting hues capturing its futile computational ebbs and flows. By juxtaposing the energy poured into the crypto architecture against that used for piracy, \"Searching for Null\" offers a contemplation into a burgeoning synthetic financial folklore.<br><br>Technical Overview<br>The code documentation of this program can be found on my github <a href='https://github.com/posheadig/0/tree/main' target='_blank'>here</a>, although I recommend taking !caution! if replicating the server and using it to attack any address other than address(0) - since theoretically noone owns address(0). The live website can be accessed <a href='https://posheadig.github.io/0/' target='_blank'>here</a><iframe src='./web.html' width='100%' height='300px' style='border:0;'></iframe></div><br><br> ----------------------------------------------- <br><br>It has recently been shown in <a href='https://thewrong.org/reversetarpit' target='_blank'>the wrong biennale</a>, <a href='https://www.instagram.com/p/Cz4lnhtLRtP/?img_index=1' target='_blank'>Onassis ONX Studio</a>, and Brooklyn Arts Cluster.",
     "images":[
        {
           "src":"./assets/zero/exhibition.jpg",
           "width":"80%",
           "height":"auto",
           "footnote":"Documentation from the Onassis ONX Studio opening reception."
        },
        {
           "src":"./assets/zero/0.png",
           "width":"80%",
           "height":"auto",
           "footnote":""
        }
     ]
  },
  "Meandering Rio Commons":{
     "title":"Meandering Rio Commons",
     "description":"<br><p>The live online website can be accessed <a href=\"https://posheadig.github.io/Rio-Meander-Website/\" target=\"_blank\">here.</a></p><br><p>A web based 3D repository using materials developed during the Land Arts 2020 Adapation. It was initially geared towards producing an interpretation of the historical meanders of the Rio Grande/Bravo river US / Mexico border, a project undertaken as part of a much larger effort in cooporation with Texas Tech University, Marfa Books, Zoe Leonard Studios, and a wide research network. The original beginning of the project by Land Arts of the American West can be found <a href=\"https://landarts.org/wp-content/uploads/2020/06/2020-Land-Arts-ADAPTATION-prospectus.pdf\" target=\"_blank\">here.</a></p><br><div class=\"figure\"><img src=\"./assets/rio/rio1.png\" alt=\"Meandering Rio\" class=\"work-detail-image\"><p class=\"footnote\">Jose Villanueva’s story animated at the location of contribution (25.882778, -97.476675), 2021, digital animation. Image taken from website. source: <a href=\"https://southwestcontemporary.com/rio-meander-map/\" target=\"_blank\">Southwest Contemporary Vol. 5</a></p></div><br><div class=\"project-description\"><h4>Web</h4><p><a href=\"https://posheadig.github.io/Rio-Meander-Website/\" target=\"_blank\">Meandering Rio Website.</a></p><p><a href=\"https://posheadig.github.io/Rio-Meander-Website/Data_directory.html\" target=\"_blank\">Open Datasheet GEOJSON Files</a></p><p>Interactive and user-generated database exhibiting stories from the Rio Grande / Rio Bravo river.</p><p>In collaboration with Land Arts of the American West & surrounding research network, and Jose Villanueva.</p><br><h4>Further Sections and Offshoots of the Greater Rio Project</h4><ul><li>Taylor, Chris. \"<a href=\"https://ar.fa.uni-lj.si/2020/drawing-time-making-the-rio-meander-map\" target=\"_blank\">Drawing Time: Making the Rio Meander Map</a>.\" Architectural Research, 2020.</li><li>Villanueva J. O'Shea P. \"<a href=\"https://southwestcontemporary.com/rio-meander-map/\" target=\"_blank\">Rio Meander Map</a>.\" Southwest Contemporary vol 5, 2022.</li><li>O'Shea, Patrick. \"<a href=\"https://github.com/posheadig/Rio-Meander-Website\" target=\"_blank\">Rio Meander Project Repository</a>.\" GitHub, 2022.</li><li>Leonard, Zoe. \"<a href=\"https://www.artbook.com/9783775748780.html\" target=\"_blank\">Al río / To the River</a>.\" Artbook, 2022. ISBN: 9783775748780.</li><li>Villoro, Federico Pérez. \"<a href=\"https://www.servinglibrary.org/journal/17/a-self-avoiding-river\" target=\"_blank\">A Self-Avoiding River</a>.\" Serving Library, 2022.</li></ul></div></div>",
     "images":[
        {
           "src":"./assets/rio/4.png",
           "width":"70%",
           "height":"auto",
           "footnote":"Excerpt from publication. source: <a href=\"https://southwestcontemporary.com/rio-meander-map/\" target=\"_blank\">Southwest Contemporary Vol. 5</a>"
        },
        {
           "src":"./assets/rio/ec5.gif",
           "width":"50%",
           "height":"auto",
           "footnote":"timelapse of Normalized Difference Vegetation Index (NDVI) in El Paso area, using GEE."
        }
     ]
  },
  "Cyano-Bot":{
     "title":"Cyano-Bot",
     "description":"Exploratory research into the use of robotics in Lake Champlain, where the robot embodies a blob of cyanobacteria. The autonomous robot is made from a microcontroller and micro-electric water pumps that propel the body in search of the brightest sunlight.<br> <br> The movement of the autonomous robot is received by a 3D environment program which takes its photosensor data and projects it into the 3D environment, which depicts a cityscape after the sea level has risen to a point where the habitat for cyanobacteria has become ideal. ",
     "images":[
        {
           "src":"./assets/cyanobot/2.png",
           "width":"90%",
           "height":"auto",
           "footnote":""
        },
        {
           "src":"./assets/cyanobot/1.png",
           "width":"80%",
           "height":"auto",
           "footnote":""
        }
     ]
  },
  "DEM film":{
     "title":"DEM film",
     "description":"A short film exploring the change of the Winooski River in Vermont, USA. Through computer-generated imagery and audio field recordings, this project creates a digital map of the river from 1900 until now. The Winooski River, once vital for the Native American Abenaki people, facilitated social movement within the Lake Champlain water basin. Since colonization, its essence has been reshaped by the advent of electricity, gas, roads, and private ownerships. The creation of this short film involved digitizing and archiving maps to recreate the river's various states over time. Incorporating audio from different locations along the river, we aimed to encapsulate the life of its inhabitants, both human and non-human.<br><br><br> -----------------------------------------<br> Shown in the Goethe-Institute CHEMICAL (RE)ACTIONS Film Festival [2021]",
     "images":[
        {
           "src":"./assets/dem/ec2.gif",
           "width":"50%",
           "height":"auto",
           "footnote":"A sequence from the introduction of the film. The full film can be viewed <a href='https://vimeo.com/549680230' target='_blank'>here</a>."
        },
        {
           "src":"./assets/dem/3.png",
           "width":"50%",
           "height":"auto",
           "footnote":"Image captured from a Machine Learning recognition program."
        }
     ]
  },
  "culvert blog":{
     "title":"culvert blog",
     "description":"<iframe src='https://culvert.home.blog/' width='100%' height='700px'></iframe>",
     "images":[
        
     ]
  },
  "eniwetok":{
     "title":"eniwetok",
     "description":"<iframe src='./assets/eniwetok.pdf#zoom=150' width='100%' height='700px'></iframe>",
     "images":[
        
     ]
  },
  "Hydro-Electro-Poetics":{
     "title":"Hydro-Electro-Poetics",
     "description":"<br><br><br>Practice based research: process of developing kinetic models combing analogical and digital components.&nbsp;<br><br><small>The videos below represent the stages of development and instrumentation. <br><iframe frameborder=\"0\" width=\"480\" height=\"520\" src=\"https://player.vimeo.com/video/244088261?h=485a3a4732&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479\" allowfullscreen=\"\" allow=\"autoplay; fullscreen; picture-in-picture\" title=\"River Orchestra Machine #1\"></iframe></small><br><br><iframe src=\"https://player.vimeo.com/video/699778827?h=7a1b56a50e&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479\" width=\"50%\" height=\"auto\" frameborder=\"0\" allow=\"autoplay; fullscreen; picture-in-picture\" allowfullscreen=\"\" title=\"hydrorefactor\" style=\"width: 90%; height: 494.019px;\" class=\"\"></iframe><br>Hydrorefractor 2019, shown as part of <a href=\"https://ats50th.art/\" target=\"_blank\"><span style=\"color: #f00;\">ATS 50th</span></a> in Chicago. Computer cooling propelled mechanism creating diffracting light patterns &amp; kinetic movement of H20 atomic structures phase shifting.&nbsp;<br><br><div class=\"image-gallery\" gid=\"1\"><iframe frameborder=\"0\" width=\"380\" height=\"1020\" src=\"https://player.vimeo.com/video/702333275?h=20415e1900&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479\" allowfullscreen=\"\" allow=\"autoplay; fullscreen; picture-in-picture\" title=\"IMG_6958\"></iframe><iframe frameborder=\"0\" width=\"420\" height=\"400\" src=\"https://player.vimeo.com/video/294019088?h=ea9a891e1d&amp;title=0&amp;byline=0&amp;portrait=0&amp;speed=0&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479\" allowfullscreen=\"\" allow=\"autoplay; fullscreen; picture-in-picture\" title=\"(work in progress) Fuller inverse shape machine\"></iframe></div><div grid-row=\"\" grid-pad=\"1\" grid-gutter=\"2\"><div grid-col=\"4\" grid-pad=\"1\" class=\"\">River mobile (2017) propelled by the river and outputting friction of movement via audio amplification.&nbsp;</div><div grid-col=\"3\" grid-pad=\"1\" class=\"\">2018. Prototype of mechanisms seen in Hydrorefractor (above). Article about process found in <a href=\"https://fnewsmagazine.com/2018/12/im-an-alien-and-i-learned-stuff-about-human-art-at-saics-mfa-open-studios/\" target=\"_blank\"><span style=\"color: #ff0606;\">FNews Magazine</span></a>.</h2></div><div grid-col=\"5\" grid-pad=\"1\" class=\"\"><br></div></div><br><br><br><small>“The relationship of humans with nature is indeed a funny one — funny, at least, for someone like me whose fate is not intricately bound up with the Earth’s. I cannot think about the lovely little art-machines of Patrick O’Shea (MFA Art and Technology, 2020) without thinking of their opposite forms: the pumping arm of an oil drilling rig at work, for example, or any other machine that contains or devours any given natural resource. O’Shea’s machines meet the natural on the meekest and most lyrical of terms. In one, a single heart-shaped leaf — fresh-picked, presumably — trawls around in a circle, pulled by a rotating arm at the center of a round dish of water. Would that this foolish species operated with this level of care on its once-green planet!” -Leah Gallant, Fnews Magazine 2018</small><br><br><div style=\"text-align: center\"><iframe src=\"https://player.vimeo.com/video/300312857?h=f1550e9dd1&amp;title=0&amp;byline=0&amp;portrait=0&amp;speed=0&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479\" width=\"60%\" height=\"auto\" frameborder=\"0\" allow=\"autoplay; fullscreen; picture-in-picture\" allowfullscreen=\"\" title=\"Marine Magnet\" style=\"width: 80%; height: 1280px;\" class=\"\"></iframe><br></div>&nbsp;<div style=\"text-align: center;\">Marine Magnetism. 2018<br><small>Leaf floating on water. Inspired by the relationship between the tides, magnetic field, and rising heat. <br><br>Example seen here, from <a href=\"https://svs.gsfc.nasa.gov/12477\" target=\"_blank\">NASA Visualization Explorer</a>:&nbsp;</small><iframe src=\"https://player.vimeo.com/video/714424576?h=52e85083e0&amp;badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479\" width=\"480\" height=\"270\" frameborder=\"0\" allow=\"autoplay; fullscreen; picture-in-picture\" allowfullscreen=\"\" title=\"12450_Tidal_Magnetic_Animation_high.mp4\" style=\"width: 480px; height: 270px;\"></iframe><br><br></div>",
     "images":[
        
     ]
  },
  "Archive Photogrammetry":{
     "title":"Archival Photogrammetry",
     "description":"<small><span style=\"color: #000;\">Northern Lights</span></small><br><br><small><span style=\"color: #040404;\"><br>3D model created from 2200 archival images of the Aurora Borealis, taken by NASA astronauts aboard the International Space Station.</span></small><br><br><div class=\"image-gallery\" gid=\"3\"><img src=\"./assets/photogram/1.jpeg\" alt=\"Image 1\" width=\"50%\" height=\"auto\"><img src=\"./assets/photogram/2.png\" alt=\"Image 2\" width=\"50%\" height=\"auto\"><img src=\"./assets/photogram/3.jpg\" alt=\"Image 3\" width=\"50%\" height=\"auto\"></div><br><br><small><span style=\"color: #f00;\">(inverted to emphasize color):</span></small><br><br><iframe src=\"https://app.vectary.com/p/3zLELW5mE7Z3kPVZwvoiiP\" frameborder=\"0\" width=\"100%\" height=\"480\" style=\"width: 100%; height: 480px;\"></iframe><br><br><br><br><br>Storm<br><br>Model created from archival images taken aboard the International Space Station, and stored as Wiki “dumps” where millions of NASA astronaut photography is uploaded and stored incrementally. 3D model is shown below, and composed of over 1200 images, tracking a 5 hour duration during a storm.&nbsp;<br><br><div class=\"image-gallery\" gid=\"6\"><img src=\"./assets/photogram/4.jpeg\" alt=\"Image 4\" width=\"50%\" height=\"auto\"><img src=\"./assets/photogram/5.jpeg\" alt=\"Image 5\" width=\"50%\" height=\"auto\"><img src=\"./assets/photogram/6.jpg\" alt=\"Image 6\" width=\"50%\" height=\"auto\"></div><br><br><iframe src=\"https://app.vectary.com/p/35pBnIXesI5xGM2mliWvTY\" frameborder=\"0\" width=\"100%\" height=\"480\" style=\"width: 100%; height: 480px;\"></iframe><br><br><br>",
     "images":[
        
     ]
  },
  "COP26: Into the Oceanic":{
     "title":"COP26: Into the Oceanic",
     "description":"In 'Into the Oceanic,' I served as a monitor and ethnographer during its unveiling at COP26, organized by the Glasgow School of Art. Invited by artists Elizabeth Ogilvie and Robert Page, this project ventures deep into the symbiotic relationship between humanity and the oceanic realm. It's a critical examination of our times, merging art, science, and activism to spotlight the essential role oceans play in sustaining life. Through engaging installations and workshops, it facilitates a contemplative dialogue on ocean conservation and our intertwined existences. My role involved documenting the project's week-long journey, capturing the essence of its immersive and impactful discourse on marine health. View the project description <a href='https://artport-project.org/portfolio/we-are-ocean-into-the-oceanic-cop26/' target='_blank'>here</a>. <br><img src='./assets/oceanic/1.png' alt='Documentation of Into the Oceanic activities' width='100%' height='auto'><br><img src='./assets/oceanic/2.png' alt='Insights into the immersive experience of the project' width='100%' height='auto'><br><img src='./assets/oceanic/3.png' alt='Insights into the immersive experience of the project' width='100%' height='auto'><br><img src='./assets/oceanic/4.png' alt='Insights into the immersive experience of the project' width='100%' height='auto'><br><img src='./assets/oceanic/5.png' alt='Insights into the immersive experience of the project' width='100%' height='auto'><br><img src='./assets/oceanic/6.JPG' alt='Insights into the immersive experience of the project' width='100%' height='auto'>",
     "images":[
        
     ]
  },
  "LiDaR ShoreLINE":{
   "title":"LiDaR ShoreLINE",
   "description": "A study of various measurement tools referring to the concept of coastline paradox, using Lidar, string and stick method, and archival images.<br><br> <img src=\"./assets/shore/3.jpg\" style=\"width: 50%;\"><br><br> -------------------------- <br><br> version exhibted in virtual Ars Electronica Gardens exhibtion.",
   "images":[
      {
         "src":"./assets/shore/2.gif",
         "width":"50%",
         "height":"auto",
         "footnote":"GIS Lidar based measurement method"
      },
      {
         "src":"./assets/shore/storm.gif",
         "width":"50%",
         "height":"auto",
         "footnote":"string and stick method for measurement"
      }
      
   ]
}
}
